@include('components.header')

<h1>{{ $title }}</h1>

<!-- За замовчуванням шаблонізатов Blade, має захист від CSRF атак

CSRF (Cross-Site Request Forgery) – це тип атаки, при якому зловмисник змушує користувача виконати небажані дії на
веб-сайті, на якому той автентифікований. В контексті Laravel, використання CSRF-токенів є критично важливим для захисту
від таких атак. -->

<!-- Запис нижче, не пропустить відтворення HTML тегів -->
{{ '<strong>Hello!!!</strong>' }}

<!-- А цей запис, може дозволити відтворення HTML тегів -->
{!! '<i> Hello </i>' !!}

<!-- Також шалонізатор, підтримує відтвоерння фукцій -->

{{ mb_strlen('Привіт світ, як твої справи???') }}


<!-- У Laravel, запис @{{ variable }} використовується для уникнення конфліктів між шаблонізатором Blade і фронтенд-фреймворками,
такими як Vue.js або Angular, які використовують схожий синтаксис для прив'язки даних. -->
@{{ variable }}

<!-- Директива @verbatim в Laravel використовується для уникнення обробки вмісту між її тегами шаблонізатором Blade.
Це особливо корисно, коли потрібно вставити код, який містить подвійні фігурні дужки {{ }}, і ви хочете, щоб
цей код був виведений буквально, без інтерпретації Blade.

Також, такий варінт, вокористовується на випадок, якщо вн ас багато змінних, які використовуються з JS фреймворків
-->

@verbatim
    <script type="text/javascript">
        new Vue({
            el: '#app',
            data: {
                message: 'Hello, World!'
            },
            template: '<div>{{ message }}</div>'
        });
    </script>
@endverbatim

@include('components.footer')
